test_500rps.txt

Summary:
  Total:	30.6332 secs
  Slowest:	6.5994 secs
  Fastest:	0.0965 secs
  Average:	0.7214 secs
  Requests/sec:	68.6509
  
  Total data:	344892 bytes
  Size/request:	164 bytes

Response time histogram:
  0.096 [1]	|
  0.747 [1149]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  1.397 [881]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  2.047 [65]	|■■
  2.698 [2]	|
  3.348 [0]	|
  3.998 [0]	|
  4.649 [0]	|
  5.299 [0]	|
  5.949 [3]	|
  6.599 [2]	|


Latency distribution:
  10% in 0.2894 secs
  25% in 0.3971 secs
  50% in 0.7005 secs
  75% in 0.9920 secs
  90% in 1.1896 secs
  95% in 1.2971 secs
  99% in 1.6130 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0022 secs, 0.0965 secs, 6.5994 secs
  DNS-lookup:	0.0009 secs, 0.0000 secs, 0.0389 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0005 secs
  resp wait:	0.7178 secs, 0.0964 secs, 6.5992 secs
  resp read:	0.0014 secs, 0.0000 secs, 0.0958 secs

Status code distribution:
  [200]	2103 responses